Revit 2027 API
ReinforcementSettings.RebarShapeDefinesEndTreatments Property
 End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RebarShapeDefinesEndTreatments { get; set; }
Public Property RebarShapeDefinesEndTreatments As Boolean
	Get
	Set
public:
property bool RebarShapeDefinesEndTreatments {
	bool get ();
	void set (bool value);
}
member RebarShapeDefinesEndTreatments : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more Rebar elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more RebarContainer elements. the document contains one or more RebarContainer elements.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace